In [1]:
import numpy as np

In [7]:
numbers = [1,2,3,4,5,6,7,8,9,10]
arr = np.array(numbers)
arr
print("matrix arr :\n",arr)

matrix arr :
 [ 1  2  3  4  5  6  7  8  9 10]

In [11]:
numbers2 = [1,20]
arr = np.array(numbers2)
arr

array([ 1, 20])

In [13]:
import pandas as pd

In [17]:
data = {'Fruits':['Apple','Orange','Banana','Pears'],\
        'numbers':[3,1,2,4]}
df = pd.DataFrame(data)
df

   Fruits  numbers
0   Apple        3
1  Orange        1
2  Banana        2
3   Pears        4

In [19]:
mydata = {'name' : ["Ivan","Lachu","Geethu","Lekshmi","Rahul","Achu","Ammu","Adan","Kichu","Chinnu"],
          'age' : [16,18,20,22,28,12,15,21,25,29],
          'gender' :["Male","Female","Female","Female","Male","Male","Female","Male","Male","Female"]}

df = pd.DataFrame(mydata)
df

      name  age  gender
0     Ivan   16    Male
1    Lachu   18  Female
2   Geethu   20  Female
3  Lekshmi   22  Female
4    Rahul   28    Male
5     Achu   12    Male
6     Ammu   15  Female
7     Adan   21    Male
8    Kichu   25    Male
9   Chinnu   29  Female

In [21]:
new_col = ["Programmer","Manager","Analyst","IT","Engineer","Manager","IT","Analyst","Programmer","IT"]
df["Occupation"] = new_col
df

      name  age  gender  Occupation
0     Ivan   16    Male  Programmer
1    Lachu   18  Female     Manager
2   Geethu   20  Female     Analyst
3  Lekshmi   22  Female          IT
4    Rahul   28    Male    Engineer
5     Achu   12    Male     Manager
6     Ammu   15  Female          IT
7     Adan   21    Male     Analyst
8    Kichu   25    Male  Programmer
9   Chinnu   29  Female          IT

In [25]:
print(df[['age']])

   age
0   16
1   18
2   20
3   22
4   28
5   12
6   15
7   21
8   25
9   29

In [31]:
df.to_csv('file1.csv',index = False)